Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can expose endpoints on the management interface by registering routes on the management router. To access the router use the following code:
ja_jp: マネジメントルーターにルートを登録することで、マネジメントインタフェースにエンドポイントを公開することができます。ルーターにアクセスするには、次のコードを使用します:

source: You can expose them on a separate network interface and port by setting `quarkus.management.enabled=true` in your application configuration. Note that this property is a build-time property. The value cannot be overridden at runtime.
ja_jp: アプリケーション設定で `quarkus.management.enabled=true` を設定することで、それらを別のネットワークインターフェイスとポートで公開できます。 このプロパティーはビルド時のプロパティーである点に注意してください。 値は、実行時にオーバーライドできません。

source: You can fetch or stream runtime data (rather than <<Build time data>> discussed earlier) or execute methods against the runtime classpath (as opposed to deployment classpath). There are two parts to getting data during runtime. The Java side in the runtime module, and then the usage in the web component.
ja_jp: ランタイムデータ (前述の <<Build time data>> ではない) を取得またはストリーミングするか、ランタイムクラスパス (デプロイメントクラスパスの対照) に対してメソッドを実行できます。実行時のデータ取得には、ランタイムモジュールの Java 側と、Web コンポーネントでの使用という 2 つのパートがあります。

source: You can fetch or stream runtime data (rather than Build time data discussed earlier) or execute methods against the runtime classpath (as opposed to deployment classpath). There are two parts to getting data during runtime. The Java side in the runtime or runtime-dev module, and then the usage in the web component (that we will discuss later).
ja_jp: ランタイムデータ (以前に議論したビルド時データではなく) をフェッチまたはストリーミングしたり、ランタイムクラスパスに対してメソッドを実行したりできます (デプロイメントクラスパスとは対照的に)。実行時にデータを取得するには2つのパートがあります。ランタイムまたは runtime-dev モジュールの Java 側と、Web コンポーネントでの使用 (これについては後で説明します) です。

source: You can filter OIDC client registration and registered client requests registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, as well as customize a request body.
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、OIDC クライアント登録と登録済みクライアントリクエストをフィルタリングできます。これにより、新しいリクエストヘッダーを更新または追加できるほか、リクエストボディをカスタマイズできます。

source: You can filter OIDC client registration and registered client requests registering one or more `OidcRequestFilter` implementations, which can update or add new request headers. For example, a filter can analyze the request body and add its digest as a new header value:
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、OIDC クライアント登録と登録済みクライアントリクエストをフィルタリングできます。これにより、新しいリクエストヘッダーを更新または追加できます。たとえば、フィルターでリクエストボディーを分析し、そのダイジェストを新しいヘッダー値として追加できます。

source: You can filter OIDC requests made by OIDC client to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, customize or analyze the request body.
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、OIDC クライアントから OIDC プロバイダーに対して行われた OIDC リクエストをフィルター処理できます。これにより、新しいリクエストヘッダーを更新または追加したり、リクエスト本文をカスタマイズまたは分析したりすることができます。

source: You can filter OIDC requests made by OIDC client to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, or analyze the request body.
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、OIDC クライアントから OIDC プロバイダーに対して行われた OIDC リクエストをフィルター処理できます。これにより、新しいリクエストヘッダーを更新または追加したり、リクエスト本文を分析したりすることができます。

source: You can filter OIDC requests made by Quarkus to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers and can also log requests.
ja_jp: 1つまたは複数の `OidcRequestFilter` 実装を登録することで、QuarkusからOIDCプロバイダへのOIDCリクエストをフィルタリングすることが出来、リクエストヘッダを更新または追加したり、リクエストをログに記録したりすることができます。

source: You can filter OIDC requests made by Quarkus to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, and log requests. For more information, see xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-request-filters[OIDC request filters].
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録すると、Quarkus から OIDC プロバイダーに対して行われた OIDC リクエストをフィルタリングできます。この実装により、新しいリクエストヘッダーを更新または追加したり、リクエストをログに記録したりできます。 詳細は、xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-request-filters[OIDC リクエストフィルター] を参照してください。

source: You can filter OIDC requests made by Quarkus to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, customize a request body and can also log requests.
ja_jp: 1つ以上の `OidcRequestFilter` 実装を登録することで、Quarkus から OIDC プロバイダーへ行われる OIDC リクエストをフィルタリングできます。これにより、新しいリクエストヘッダーの更新や追加、リクエストボディのカスタマイズ、およびリクエストのログ記録が可能です。

source: You can filter OIDC requests made by Quarkus to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, customize a request body, and also log requests.
ja_jp: Quarkus が OIDC プロバイダーに対して行う OIDC リクエストは、1 つ以上の `OidcRequestFilter` 実装を登録することでフィルタリングできます。これにより、新しいリクエストヘッダーの更新や追加、リクエストボディのカスタマイズ、およびリクエストのログ記録が可能です。

source: You can filter OIDC requests made by Quarkus to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers. For example, a filter can analyze the request body and add its digest as a new header value:
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、Quarkus が OIDC プロバイダーに対して行った OIDC リクエストをフィルタリングできます。これにより、新しいリクエストヘッダーを更新または追加できます。たとえば、フィルターはリクエスト本文を分析し、そのダイジェストを新しいヘッダー値として追加できます。

source: You can filter OIDC requests made by the OIDC client to the OIDC provider by registering one or more `OidcRequestFilter` implementations, which can update or add new request headers, customize or analyze the request body.
ja_jp: 1 つ以上の `OidcRequestFilter` 実装を登録することで、OIDC クライアントから OIDC プロバイダーへの OIDC リクエストをフィルター処理できます。これにより、新しいリクエストヘッダーを更新または追加したり、リクエスト本文をカスタマイズまたは分析したりできます。

source: You can filter responses from the OIDC providers by registering one or more `OidcResponseFilter` implementations, which can check the response status, headers and body in order to log them or perform other actions.
ja_jp: 1 つ以上の `OidcResponseFilter` 実装を登録することで、OIDC プロバイダーからのレスポンスをフィルタリングできます。これにより、レスポンスのステータス、ヘッダー、本文をチェックして、ログに記録したり、その他のアクションを実行したりできます。

source: You can filter responses from the OIDC providers by registering one or more `OidcResponseFilter` implementations, which can check the response status, headers, and body to log them or perform other actions.
ja_jp: OIDC プロバイダーからのレスポンスは、1 つ以上の `OidcResponseFilter` 実装を登録することでフィルタリングできます。これにより、レスポンスのステータス、ヘッダー、本文をチェックして、ログに記録したり、その他のアクションを実行したりできます。

source: You can filter responses to OIDC client registration and registered client requests by registering one or more `OidcResponseFilter` implementations, which can check the response status, headers and body in order to log them or perform other actions.
ja_jp: 1 つ以上の `OidcResponseFilter` 実装を登録することで、OIDC クライアント登録および登録済みクライアントリクエストへのレスポンスをフィルタリングできます。これにより、レスポンスのステータス、ヘッダー、ボディーをチェックしてログに記録したり、その他のアクションを実行したりできます。

source: You can filter responses to OIDC client requests by registering one or more `OidcResponseFilter` implementations that can check the response status, headers, and body to log them or perform other actions.
ja_jp: 1 つ以上の `OidcResponseFilter` 実装を登録することで、OIDC クライアント要求への応答をフィルタリングできます。これらの実装は、応答ステータス、ヘッダー、および本文をチェックして、それらをログに記録したり、その他のアクションを実行したりできます。

source: You can filter responses to the OIDC client requests by registering one or more `OidcResponseFilter` implementations, which can check the response status, headers and body, in order to log them or perform other actions.
ja_jp: 1 つ以上の `OidcResponseFilter` 実装を登録することで、OIDC クライアント要求への応答をフィルタリングできます。これにより、応答のステータス、ヘッダー、本文をチェックして、ログに記録したり、その他のアクションを実行したりできます。

source: You can find a set of extensions to access various Google Cloud Services in the Quarkiverse (a GitHub organization for Quarkus extensions maintained by the community), including PubSub, BigQuery, Storage, Spanner, Firestore, Secret Manager (visit the repository for an accurate list of supported services).
ja_jp: PubSub、BigQuery、Storage、Spanner、Firestore、Secret Managerなど、さまざまなGoogle Cloud Servicesにアクセスするためのエクステンションのセットが、Quarkiverse（コミュニティによって維持されているQuarkusエクステンションのためのGitHub organization）にあります（サポートされているサービスの正確なリストについては、リポジトリをご覧ください）。

source: You can find additional information on how to migrate to the new extensions in https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[our migration guide].
ja_jp: 新しいエクステンションへの移行方法については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[移行ガイド]をご覧ください。

source: You can find all information about Spatial in the Hibernate user guide: link:{hibernate-orm-docs-url}#spatial[Hibernate ORM Spatial].
ja_jp: Spatial に関するすべての情報は、Hibernate ユーザーガイドに記載されています。 link:{hibernate-orm-docs-url}#spatial[Hibernate ORM Spatial] 。

source: You can find all the details about it in link:/guides/security-webauthn[the dedicated guide].
ja_jp: その詳細は、 link:/guides/security-webauthn[個別のガイド] に記載されています。

source: You can find all the valid positions https://vaadin.com/docs/latest/components/notification/#position[here].
ja_jp: 有効な位置はすべて https://vaadin.com/docs/latest/components/notification/#position[こちら] で確認できます。

source: You can find below a curl example of such call for a `client_credential` flow:
ja_jp: 以下に、 `client_credential` フローに対するこのような呼び出しのcurlの例を示します:

source: You can find detailed information about this `Random`/`SplittableRandom` issue in https://foivos.zakkak.net/tutorials/working-with-randoms-native-images/[this blog post].
ja_jp: この `Random`/`SplittableRandom` の問題については、https://foivos.zakkak.net/tutorials/working-with-randoms-native-images/[このブログ記事] に詳細な情報があります。

source: You can find more details in our https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12#fast-jar-as-default[Migration guide].
ja_jp: 詳細は link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-1.12#fast-jar-as-default[移行ガイド] をご覧ください。

source: You can find more examples and hints in the xref:testing-components.adoc[testing components reference guide].
ja_jp: さらに多くの例とヒントについては、 xref:testing-components.adoc[テストコンポーネントリファレンスガイド] を参照してください。

source: You can find more information about all this in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[the GraalVM documentation].
ja_jp: これらすべての情報は、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[GraalVMのドキュメント]に記載されています。

source: You can find more information about all this in https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[the GraalVM documentation].
ja_jp: これらすべての情報は、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[GraalVMのドキュメント]に記載されています。

source: You can find more information about compatible distributions and versions of Elasticsearch in link:{hibernate-search-doc-prefix}#getting-started-compatibility[this section of Hibernate Search's reference documentation].
ja_jp: 互換性のあるディストリビューションやElasticsearchのバージョンについては、 link:{hibernate-search-doc-prefix}#getting-started-compatibility[Hibernate Searchのリファレンスドキュメントのこのセクション] に詳細情報が記載されています。

source: You can find more information about compatible distributions and versions of Elasticsearch in link:{hibernate-search-docs-url}#compatibility[this section of Hibernate Search's reference documentation].
ja_jp: Elasticsearch の互換性のあるディストリビューションとバージョンの詳細は、 link:{hibernate-search-docs-url}#compatibility[Hibernate Search の参照ドキュメントのこちらのセクション] を参照してください。

source: You can find more information about how to configure the native image building process in the <<configuration-reference>> section below.
ja_jp: ネイティブイメージ構築プロセスの設定方法の詳細は、以下の <<configuration-reference>> セクション参照してください。

source: You can find more information about how to configure the native image building process in the xref:configuration-reference[Configuring the Native Executable] section below.
ja_jp: ネイティブイメージビルドの設定方法については、下記の xref:configuration-reference[ネイティブ実行可能ファイルの設定] セクションで詳しく説明しています。

source: You can find more information about how to deploy the application in Kubernetes in the xref:deploying-to-kubernetes.adoc#deployment[the Kubernetes guide].
ja_jp: Kubernetes でアプリケーションをデプロイする方法の詳細は、xref:deploying-to-kubernetes.adoc#deployment[Kubernetes ガイド] を参照してください。

source: You can find more information about it in link:/guides/spring-data-rest[the dedicated guide].
ja_jp: 詳細については、 link:/guides/spring-data-rest[専用のガイド] をご覧ください。

source: You can find more information about it in the updated https://quarkus.io/guides/resteasy-reactive#handling-multipart-form-data[RESTEasy Reactive guide].
ja_jp: それについての詳細は、更新された link:https://quarkus.io/guides/resteasy-reactive#handling-multipart-form-data[RESTEasy Reactiveガイド]に記載されています。

source: You can find more information about the migration to OpenTelemetry at:
ja_jp: OpenTelemetry への移行に関する詳細は、以下を参照してください。

source: You can find more information about this feature and others detailed in the https://dev.mysql.com/doc/connector-j/8.0/en/connector-j-reference.html[official documentation].
ja_jp: この機能は、link:https://dev.mysql.com/doc/connector-j/8.0/en/connector-j-reference.html[公式ドキュメント] に詳しい情報が掲載されています。

source: You can find more information about this feature and others detailed in the https://mariadb.com/kb/en/library/about-mariadb-connector-j/[official documentation].
ja_jp: この機能の詳細は、link:https://mariadb.com/kb/en/library/about-mariadb-connector-j/[公式ドキュメント] に掲載されています。

source: You can find more information about this feature in the xref:hibernate-orm.adoc#flyway[Hibernate ORM guide].
ja_jp: この機能の詳細については、 link:hibernate-orm.html#flyway[Hibernate ORM ガイド]を参照してください。

source: You can find more information about this topic in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[the GraalVM documentation].
ja_jp: このトピックに関する詳しい情報は、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[GraalVMのドキュメント]に記載されています。

source: You can find more information about this topic in https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Resources/[the GraalVM documentation].
ja_jp: このトピックに関する詳しい情報は、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Resources/[GraalVMのドキュメント]に記載されています。

source: You can find more information in https://groups.google.com/g/quarkus-dev/c/18Ocz1wtKjo/m/tuRVB97aAAAJ[the announcement].
ja_jp: 詳細は link:https://groups.google.com/g/quarkus-dev/c/18Ocz1wtKjo/m/tuRVB97aAAAJ[アナウンス]をご覧ください。

source: You can find more information in the xref:http-reference#serving-static-resources[HTTP reference guide].
ja_jp: 詳細は、xref:http-reference#serving-static-resources[HTTP リファレンスガイド] を参照してください。

source: You can find more information in the xref:http-reference.adoc#serving-static-resources[HTTP reference guide].
ja_jp: 詳しくは xref:http-reference.adoc#serving-static-resources[HTTPリファレンスガイド] をご覧ください。

source: You can find more information on configuring authentication in https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_endpoint_auth-hotrod-client-configuration[Hot Rod Endpoint Authentication Mechanisms].
ja_jp: 認証の設定についての詳しい情報は https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#hotrod_endpoint_auth-hotrod-client-configuration[Hot Rod Endpoint Authentication Mechanisms] に存在します。

source: You can find some documentation about them in the link:https://docs.quarkiverse.io/quarkus-google-cloud-services/main/index.html[Quarkiverse Google Cloud Services documentation].
ja_jp: link:https://docs.quarkiverse.io/quarkus-google-cloud-services/main/index.html[Quarkiverse Google Cloud Services] のドキュメントを参照してください。

source: You can find some documentation about them in the link:https://github.com/quarkiverse/quarkiverse-google-cloud-services[Quarkiverse Google Cloud Services repository].
ja_jp: これらについてのドキュメントは、 link:https://github.com/quarkiverse/quarkiverse-google-cloud-services[QuarkiverseのGoogle Cloud Servicesリポジトリ] にあります。

source: You can find some documentation about them in the link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-google-cloud-services/main/index.html[Quarkiverse Google Cloud Services documentation].
ja_jp: これらについてのドキュメントは、 link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-google-cloud-services/main/index.html[Quarkiverse Google Cloud Services ドキュメント] にあります。

source: You can find the complete working example at: https://github.com/fabiobrz/quarkus-cel-k8s-validator
ja_jp: 完全な動作例は、こちらで確認できます。 https://github.com/fabiobrz/quarkus-cel-k8s-validator

source: You can find the latest plugin version in the https://plugins.gradle.org/plugin/org.kordamp.gradle.jandex[Gradle Plugin Portal]
ja_jp: 最新のプラグインバージョンは、 https://plugins.gradle.org/plugin/org.kordamp.gradle.jandex[Gradle プラグインポータル] で確認できます。

source: You can find the solution in the `security-jpa-quickstart` link:{quickstarts-tree-url}/security-jpa-quickstart/[directory].
ja_jp: 解決策は、 `security-jpa-quickstart` link:{quickstarts-tree-url}/security-jpa-quickstart/[ディレクトリー] にあります。

source: You can find the solution in the `security-jpa-quickstart` {quickstarts-tree-url}/security-jpa-quickstart[directory].
ja_jp: ソリューションは `security-jpa-quickstart` {quickstarts-tree-url}/security-jpa-quickstart[ディレクトリー] にあります。

source: You can follow the instructions from https://access.redhat.com/documentation/en-us/red_hat_openshift_service_registry/1/guide/ab1894d1-cae0-4d11-b185-81d62b4aabc7#_60472331-fa00-48ec-a621-bbd039500c7d[Getting started with Red Hat OpenShift Service Registry], or use the `rhoas` CLI to create a new service registry instance:
ja_jp: https://access.redhat.com/documentation/en-us/red_hat_openshift_service_registry/1/guide/ab1894d1-cae0-4d11-b185-81d62b4aabc7#_60472331-fa00-48ec-a621-bbd039500c7d[Getting started with Red Hat OpenShift Service Registry] の説明に従って、または `rhoas` CLI を使用して、新しいサービスレジストリーのインスタンスを作成することができます。

source: You can follow the xref:building-native-image.adoc[Build a native executable guide] as well as xref:deploying-to-kubernetes.adoc[Deploying Application to Kubernetes and OpenShift] for more information.
ja_jp: 詳細は link:building-native-image.html[ネイティブ実行可能ファイルのビルド]のほか、link:deploying-to-kubernetes.html[Kubernetes および OpenShift へのアプリケーションのデプロイ]を参照してください。

source: You can follow xref:deploying-to-kubernetes.adoc#openshift[Deploying to OpenShift] to deploy your application, including generated `ServiceBinding` resources. The configuration properties necessary to access the Kafka and Schema Registry instances will be injected to the application automatically at deployment.
ja_jp: xref:deploying-to-kubernetes.adoc#openshift[Deploying to OpenShift]に従って、生成した `ServiceBinding` リソースを含むアプリケーションをデプロイすることが可能です。 KafkaとSchema Registryのインスタンスにアクセスするために必要な設定プロパティは、デプロイ時に自動的にアプリケーションに注入されます。

source: You can force a CDI scope by annotating the converter/listener class with for example `@ApplicationScoped`.
ja_jp: コンバーター/リスナーのクラスに `@ApplicationScoped` などのアノテーションを付けることで、CDI スコープを強制できます。

source: You can further optimize this process by adding a simple JavaScript function that pings your Quarkus endpoint periodically to simulate user activity, thereby minimizing the time period during which the user might need to be re-authenticated.
ja_jp: ユーザーアクティビティーをシミュレートするために Quarkus エンドポイントに定期的に ping を送信する単純な JavaScript 関数を追加することで、このプロセスをさらに最適化できます。これにより、ユーザーが再認証される必要がある期間が最小限に抑えられます。

source: You can further optimize this process by having a simple JavaScript function ping your Quarkus endpoint periodically to emulate the user activity, which minimizes the time frame during which the user might have to be re-authenticated.
ja_jp: 単純な JavaScript 関数を使用して Quarkus エンドポイントに定期的に ping を送信し、ユーザーアクティビティーをエミュレートすることで、このプロセスをさらに最適化できます。これにより、ユーザーが再認証される必要がある時間枠が最小限に抑えられます。

source: You can generate the example code from Quarkus's online application generator at https://code.quarkus.io/d?e=azure-functions&cn=code.quarkus.io[this link].
ja_jp: Quarkusのオンラインアプリケーションジェネレーターから、この link:https://code.quarkus.io/d?e=azure-functions&cn=code.quarkus.io[リンク] でサンプルコードを生成できます。

source: You can generate the example code from Quarkus's online application generator at https://code.quarkus.io/d?e=azure-functions-http&cn=code.quarkus.io[this link].
ja_jp: link:https://code.quarkus.io/d?e=azure-functions&cn=code.quarkus.io[ここ] にある Quarkus オンラインアプリケーションジェネレーターから、サンプルコードを生成できます。

source: You can generate the native executable with:
ja_jp: 以下を使用して、ネイティブ実行可能ファイルを生成することができます:

source: You can generate the tokens as described in xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] section. Prepare the REST test endpoints, you can have the test frontend endpoint which uses the injected MP REST client with a registered token propagation filter to invoke on the downstream endpoint, for example, see the `integration-tests/oidc-token-propagation` in the `main` Quarkus repository.
ja_jp: xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] のセクションで説明したように、トークンを生成することができます。REST テストエンドポイントを準備します。登録されたトークン伝搬フィルターで注入された MP REST クライアントを使用するテストフロントエンドエンドポイントは、ダウンストリームエンドポイントで呼び出すことができます。たとえば、 `main` Quarkus リポジトリーの `integration-tests/oidc-token-propagation` を参照してください。

source: You can get `HMAC` signatures created for the generated CSRF tokens and have these `HMAC` values stored as CSRF token cookies if you would like to avoid the risk of the attackers recreating the CSRF cookie token. All you need to do is to configure a token signature secret which must be at least 32 characters long:
ja_jp: 生成された CSRF トークンに `HMAC` 署名を作成し、これらの `HMAC` 値を CSRF トークン・クッキーとして保存することで、攻撃者が CSRF クッキー・トークンを再作成するリスクを回避することができます。必要なのは、少なくとも 32 文字の長さのトークン署名シークレットを設定することだけです。

source: You can get a better understanding on how to use this extension in the Quarkus Guides.
ja_jp: Quarkus ガイドで、このエクステンションの使用方法についてより深く理解することができます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.10.3.Final[the full changelog of 1.10.3.Final on GitHub].
ja_jp: https://github.com/quarkusio/quarkus/releases/tag/1.10.3.Final[GitHub上の1.10.3.Finalの完全な変更履歴]を入手できます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.10.4.Final[the full changelog of 1.10.4.Final] and the https://github.com/quarkusio/quarkus/releases/tag/1.10.5.Final[full changelog for 1.10.5.Final] on GitHub.
ja_jp: https://github.com/quarkusio/quarkus/releases/tag/1.10.4.Final[1.10.4.Finalの完全な変更履歴]と https://github.com/quarkusio/quarkus/releases/tag/1.10.5.Final[1.10.5.Finalの完全な変更履歴] をGitHubで取得出来ます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.11.1.Final[the full changelog of 1.11.1.Final on GitHub].
ja_jp: link:https://github.com/quarkusio/quarkus/releases/tag/1.11.1.Final[GitHubで1.11.1.Finalの完全な変更履歴] を入手できます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.11.2.Final[the full changelog of 1.11.2.Final on GitHub].
ja_jp: link:https://github.com/quarkusio/quarkus/releases/tag/1.11.2.Final[GitHub 上で 1.11.2.Final の完全な変更履歴] を入手できます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.11.3.Final[the full changelog of 1.11.3.Final on GitHub].
ja_jp: link:https://github.com/quarkusio/quarkus/releases/tag/1.11.3.Final[GitHubで1.11.3.Finalの完全な変更履歴]を入手できます。

source: You can get https://github.com/quarkusio/quarkus/releases/tag/1.12.1.Final[the full changelog of 1.12.1.Final on GitHub].
ja_jp: link:https://github.com/quarkusio/quarkus/releases/tag/1.12.1.Final[GitHubで1.12.1.1.Finalの完全な変更履歴]を入手できます。
